from subDS import subMarketEye
from pandas import DataFrame

if __name__ == "__main__":
    m_InfoList =[0,67,70,71,74,75,76,77,78,79,80,82,86,87,88,89,90,91,92,93,95, 96,98,99,100,101,102,103,104,105,106,107, 109,110,111]
    m_CodeList =['A005930', 'A005950']

    ### 자료가져오기
    data=subMarketEye(m_InfoList, m_CodeList)
    #print(data)
    df=DataFrame(data,  columns=['종목코드', 'PER', 'EPS', '자본금', '배당수익률', '부채비율', '유보율', '자기자본이익률', '매출액증가율', '경상이익증가율', '순이익증가율', 'VR', '매출액', '경상이익', '당기순이익', 'BPS', '영업이익증가율', '영업이익', '매출액영업이익률', '매출액경상이익률', '결산년월', '분기BPS', '분기영업이익증가율', '분기경상이익증가율', '분기순이익증가율', '분기매출액', '분기영업이익', '분기경상이익', '분기당기순이익', '분기매출액영업이익률', '분기매출액경상이익률', '분기ROE', '분기유보율', '분기부채비율', '최근분기년월'])
    print(df)
    df.to_csv('subMarketEye.csv')